#include <Servo.h>
Servo m1; //ประกาศตัวแปรแทน Servo
Servo m2; //ประกาศตัวแปรแทน Servo
Servo m3; //ประกาศตัวแปรแทน Servo
Servo m4; //ประกาศตัวแปรแทน Servo
Servo m5; //ประกาศตัวแปรแทน Servo
Servo m6; //ประกาศตัวแปรแทน Servo
Servo m7; //ประกาศตัวแปรแทน Servo
int stat = 0;
char incomingByte = 0; // for incoming serial data
void setup()
{
  Serial.begin(9600);
m1.attach(2); // กำหนดขา 9 ควบคุม Servo
m2.attach(3); // กำหนดขา 9 ควบคุม Servo
m3.attach(4); // กำหนดขา 9 ควบคุม Servo
m4.attach(5); // กำหนดขา 9 ควบคุม Servo
m5.attach(6); // กำหนดขา 9 ควบคุม Servo
m6.attach(7); // กำหนดขา 9 ควบคุม Servo
m7.attach(8); // กำหนดขา 9 ควบคุม Servo

m1.write(0); // สั่งให้ Servo หมุนไปองศาที่ 0
delay(1000); // หน่วงเวลา 1000ms
m2.write(0); // สั่งให้ Servo หมุนไปองศาที่ 0
delay(1000); // หน่วงเวลา 1000ms
m3.write(0); // สั่งให้ Servo หมุนไปองศาที่ 0
delay(1000); // หน่วงเวลา 1000ms
m4.write(0); // สั่งให้ Servo หมุนไปองศาที่ 0
delay(1000); // หน่วงเวลา 1000ms
m5.write(0); // สั่งให้ Servo หมุนไปองศาที่ 0
delay(1000); // หน่วงเวลา 1000ms
m6.write(0); // สั่งให้ Servo หมุนไปองศาที่ 0
delay(1000); // หน่วงเวลา 1000ms
m7.write(0); // สั่งให้ Servo หมุนไปองศาที่ 0
delay(1000); // หน่วงเวลา 1000ms



//  m1.write(90); // สั่งให้ Servo หมุนไปองศาที่ 0
//  delay(1000); // หน่วงเวลา 1000ms
//  m2.write(90); // สั่งให้ Servo หมุนไปองศาที่ 0
//  delay(1000); // หน่วงเวลา 1000ms
//  m3.write(90); // สั่งให้ Servo หมุนไปองศาที่ 0
//  delay(1000); // หน่วงเวลา 1000ms
//  m4.write(90); // สั่งให้ Servo หมุนไปองศาที่ 0
//  delay(1000); // หน่วงเวลา 1000ms
//  m5.write(90); // สั่งให้ Servo หมุนไปองศาที่ 0
//  delay(1000); // หน่วงเวลา 1000ms
//  m6.write(90); // สั่งให้ Servo หมุนไปองศาที่ 0
//  delay(1000); // หน่วงเวลา 1000ms
//  m7.write(90); // สั่งให้ Servo หมุนไปองศาที่ 0
//  delay(1000); // หน่วงเวลา 1000ms
//m1.write(90); // สั่งให้ Servo หมุนไปองศาที่ 0
//delay(1000); // หน่วงเวลา 1000ms
//m2.write(90); // สั่งให้ Servo หมุนไปองศาที่ 0
//delay(1000); // หน่วงเวลา 1000ms
//m3.write(90); // สั่งให้ Servo หมุนไปองศาที่ 0
//delay(1000); // หน่วงเวลา 1000ms
////m4.write(90); // สั่งให้ Servo หมุนไปองศาที่ 0
////delay(1000); // หน่วงเวลา 1000ms
//m5.write(90); // สั่งให้ Servo หมุนไปองศาที่ 0
//delay(1000); // หน่วงเวลา 1000ms
////m6.write(90); // สั่งให้ Servo หมุนไปองศาที่ 0
////delay(1000); // หน่วงเวลา 1000ms
//m7.write(90); // สั่งให้ Servo หมุนไปองศาที่ 0
//delay(1000); // หน่วงเวลา 1000ms
//
//m5.write(90); // สั่งให้ Servo หมุนไปองศาที่ 0
//delay(1000); // หน่วงเวลา 1000ms
//m3.write(90); // สั่งให้ Servo หมุนไปองศาที่ 0
//delay(1000); // หน่วงเวลา 1000ms
//m1.write(90); // สั่งให้ Servo หมุนไปองศาที่ 0
//delay(1000); // หน่วงเวลา 1000ms
//m4.write(90); // สั่งให้ Servo หมุนไปองศาที่ 0
//delay(1000); // หน่วงเวลา 1000ms
//m2.write(90); // สั่งให้ Servo หมุนไปองศาที่ 0
//delay(1000); // หน่วงเวลา 1000ms
//m6.write(90); // สั่งให้ Servo หมุนไปองศาที่ 0
//delay(1000); // หน่วงเวลา 1000ms
//m7.write(90); // สั่งให้ Servo หมุนไปองศาที่ 0
//delay(1000); // หน่วงเวลา 1000ms
//
//m7.write(0); // สั่งให้ Servo หมุนไปองศาที่ 0
//delay(1000); // หน่วงเวลา 1000ms
//m6.write(0); // สั่งให้ Servo หมุนไปองศาที่ 0
//delay(1000); // หน่วงเวลา 1000ms
//m2.write(0); // สั่งให้ Servo หมุนไปองศาที่ 0
//delay(1000); // หน่วงเวลา 1000ms
//m4.write(0); // สั่งให้ Servo หมุนไปองศาที่ 0
//delay(1000); // หน่วงเวลา 1000ms
//m1.write(0); // สั่งให้ Servo หมุนไปองศาที่ 0
//delay(1000); // หน่วงเวลา 1000ms
//m3.write(0); // สั่งให้ Servo หมุนไปองศาที่ 0
//delay(1000); // หน่วงเวลา 1000ms
//m5.write(0); // สั่งให้ Servo หมุนไปองศาที่ 0
//delay(1000); // หน่วงเวลา 1000ms


}
void loop()
{

//    myservo1.write(0); // สั่งให้ Servo หมุนไปองศาที่ 0
//    delay(1000); // หน่วงเวลา 1000ms
//    myservo1.write(90); // สั่งให้ Servo หมุนไปองศาที่ 0
//    delay(1000); // หน่วงเวลา 1000ms

//  m1.write(90); // สั่งให้ Servo หมุนไปองศาที่ 0
//  delay(1000); // หน่วงเวลา 1000ms
//  m2.write(90); // สั่งให้ Servo หมุนไปองศาที่ 0
//  delay(1000); // หน่วงเวลา 1000ms
//  m3.write(90); // สั่งให้ Servo หมุนไปองศาที่ 0
//  delay(1000); // หน่วงเวลา 1000ms
//  m4.write(90); // สั่งให้ Servo หมุนไปองศาที่ 0
//  delay(1000); // หน่วงเวลา 1000ms
//  m5.write(90); // สั่งให้ Servo หมุนไปองศาที่ 0
//  delay(1000); // หน่วงเวลา 1000ms
//  m6.write(90); // สั่งให้ Servo หมุนไปองศาที่ 0
//  delay(1000); // หน่วงเวลา 1000ms
//  m7.write(90); // สั่งให้ Servo หมุนไปองศาที่ 0
//  delay(1000); // หน่วงเวลา 1000ms
//////
//  m1.write(0); // สั่งให้ Servo หมุนไปองศาที่ 0
//  delay(1000); // หน่วงเวลา 1000ms
//  m2.write(0); // สั่งให้ Servo หมุนไปองศาที่ 0
//  delay(1000); // หน่วงเวลา 1000ms
//  m3.write(0); // สั่งให้ Servo หมุนไปองศาที่ 0
//  delay(1000); // หน่วงเวลา 1000ms
//  m4.write(0); // สั่งให้ Servo หมุนไปองศาที่ 0
//  delay(1000); // หน่วงเวลา 1000ms
//  m5.write(0); // สั่งให้ Servo หมุนไปองศาที่ 0
//  delay(1000); // หน่วงเวลา 1000ms
//  m6.write(0); // สั่งให้ Servo หมุนไปองศาที่ 0
//  delay(1000); // หน่วงเวลา 1000ms
//  m7.write(0); // สั่งให้ Servo หมุนไปองศาที่ 0
//  delay(1000); // หน่วงเวลา 1000ms

  if (Serial.available() > 0) {
    // read the incoming byte:
    incomingByte = Serial.read();

    if(incomingByte == 'a'){
      m1.write(90); // สั่งให้ Servo หมุนไปองศาที่ 0
      delay(1000); // หน่วงเวลา 1000ms
    }
    if(incomingByte == 'b'){
      m2.write(90); // สั่งให้ Servo หมุนไปองศาที่ 0
      delay(1000); // หน่วงเวลา 1000ms
    }
    if(incomingByte == 'c'){
      m3.write(90); // สั่งให้ Servo หมุนไปองศาที่ 0
      delay(1000); // หน่วงเวลา 1000ms
    }
    if(incomingByte == 'd'){
      m4.write(90); // สั่งให้ Servo หมุนไปองศาที่ 0
      delay(1000); // หน่วงเวลา 1000ms
    }
    if(incomingByte == 'e'){
      m5.write(90); // สั่งให้ Servo หมุนไปองศาที่ 0
      delay(1000); // หน่วงเวลา 1000ms
    }
    if(incomingByte == 'f'){
      m6.write(90); // สั่งให้ Servo หมุนไปองศาที่ 0
      delay(1000); // หน่วงเวลา 1000ms
    }
    if(incomingByte == 'g'){
      m7.write(90); // สั่งให้ Servo หมุนไปองศาที่ 0
      delay(1000); // หน่วงเวลา 1000ms
    }
  }



}
